In [3]:
import pandas as pd
print(pd.__version__)

1.1.1

# Q2

# import numpy as np
l=list(range(1,5))
a=np.arange(1,9)
dt={'a':0,'b':1,'c':2}
s1=pd.Series(l,index=[0,1,2,3])
s2=pd.Series(a)
s3=pd.Series(dt)
print(s1)
print(s2)
print(s3)

# Q3

In [9]:
s1.to_frame()

   0
0  1
1  2
2  3
3  4

In [10]:
s1.reset_index()
s1

0    1
1    2
2    3
3    4
dtype: int64

# Q4

In [13]:
a_series=pd.Series(['ammu','josu','rosu','luke','eva'])
b_series=pd.Series([10,9,8,7,6])
df=pd.DataFrame()
df=pd.concat([a_series,b_series],axis=1)
df

      0   1
0  ammu  10
1  josu   9
2  rosu   8
3  luke   7
4   eva   6

# Q5

In [14]:
name=['Grace','Rosu','Eliz']
n=pd.Series(name,index=['s1','s2','s3'])
n.index.name='Sl_No'
n

Sl_No
s1    Grace
s2     Rosu
s3     Eliz
dtype: object

# Q6

In [15]:
sr1=pd.Series([2,4,6,8,10,12])
sr2=pd.Series([1,2,5,8,9,10])
res=sr1[~sr1.isin(sr2)]
res

1     4
2     6
5    12
dtype: int64

# Q7

In [16]:
union=pd.Series(np.union1d(sr1,sr2))
intersect=pd.Series(np.intersect1d(sr1,sr2))
nocomm=union[~union.isin(intersect)]
nocomm

0     1
2     4
3     5
4     6
6     9
8    12
dtype: int64

# Q8

In [17]:
num=np.random.RandomState(100)
num_series=pd.Series(num.normal(10,4,20))
print(num_series)
res=np.percentile(num_series,q=[0,25,50,75,100])
print("minimum,25th percentile,median,75th,maximum:")
print(res)

0      3.000938
1     11.370722
2     14.612143
3      8.990256
4     13.925283
5     12.056875
6     10.884719
7      5.719827
8      9.242017
9     11.020006
10     8.167892
11    11.740654
12     7.665620
13    13.267388
14    12.690883
15     9.582355
16     7.874878
17    14.118931
18     8.247458
19     5.526727
dtype: float64
minimum,25th percentile,median,75th,maximum:
[ 3.00093811  8.09463867 10.23353705 12.21537733 14.61214321]

# Q9

In [18]:
city=pd.Series(['Australia','Europe','India','Rome','Europe','London','Rome']
            )
city.value_counts()

Europe       2
Rome         2
India        1
London       1
Australia    1
dtype: int64

# Q10

In [19]:
city[~city.isin(city.value_counts().index[:2])]='Other'
city

0     Other
1    Europe
2     Other
3      Rome
4    Europe
5     Other
6      Rome
dtype: object

# Q11

In [20]:
pd.qcut(num_series,q=10)

0         (3.0, 5.701]
1      (11.16, 11.836]
2     (13.945, 14.612]
3       (8.224, 9.141]
4     (12.806, 13.945]
5     (11.836, 12.806]
6      (10.234, 11.16]
7       (5.701, 7.833]
8      (9.141, 10.234]
9      (10.234, 11.16]
10      (7.833, 8.224]
11     (11.16, 11.836]
12      (5.701, 7.833]
13    (12.806, 13.945]
14    (11.836, 12.806]
15     (9.141, 10.234]
16      (7.833, 8.224]
17    (13.945, 14.612]
18      (8.224, 9.141]
19        (3.0, 5.701]
dtype: category
Categories (10, interval[float64]): [(3.0, 5.701] < (5.701, 7.833] < (7.833, 8.224] < (8.224, 9.141] ... (11.16, 11.836] < (11.836, 12.806] < (12.806, 13.945] < (13.945, 14.612]]

# Q12

In [21]:
pd.DataFrame(np.arange(1,10).reshape(3,3))

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

# Q13

In [22]:
srA=pd.Series(np.random.randint(1,10,10))
print(srA)
srA.where(lambda x:x%3==0).dropna()

0    3
1    8
2    5
3    6
4    9
5    1
6    4
7    2
8    7
9    5
dtype: int32

0    3.0
3    6.0
4    9.0
dtype: float64

# Q14

In [24]:
pos=[2,5,6]
srA.loc[pos]

2    5
5    1
6    4
dtype: int32

# Q15

In [28]:
sr1.append(sr2)
print("horizontal:\n",pd.concat([sr1,sr2],axis=0))
print("vertical:\n",pd.concat([sr1,sr2],axis=1))

horizontal:
 0     2
1     4
2     6
3     8
4    10
5    12
0     1
1     2
2     5
3     8
4     9
5    10
dtype: int64
vertical:
     0   1
0   2   1
1   4   2
2   6   5
3   8   8
4  10   9
5  12  10

# Q16

In [29]:
ls=list(sr1[sr1.isin(sr2)].index)
ls

[0, 3, 4]

# Q17